#Простые типы данных

#Задание 1
v = input("Введите число от 1 до 10 ")
print(int(v) + 10)

#Задание 2
name = input('Введите ваше имя: ')
print(f'Привет, {name}! Как дела?')

#Задание 3
print(float('1'))
print(int('2.5'))
print(bool(1))
print(bool(''))
print(bool(0))